// Не всегда адекватно работает (хз почему)
//  // Количество пробелов
//   // Создаем временный canvas context
//   const canvas = document.createElement("canvas");
//   const ctx = canvas.getContext("2d");
//   // Задаем шрифт и размер
//   const fontFamily = "Arimo";
//   const fontSize = 12; // в пикселях
//   // Применяем шрифт и размер к контексту canvas
//   ctx.font = `${fontSize}px ${fontFamily}`;
//   // Получаем список символов украинского алфавита
//   const ukrainianAlphabet = [
//     "А",
//     "Б",
//     "В",
//     "Г",
//     "Ґ",
//     "Д",
//     "Е",
//     "Є",
//     "Ж",
//     "З",
//     "И",
//     "І",
//     "Ї",
//     "Й",
//     "К",
//     "Л",
//     "М",
//     "Н",
//     "О",
//     "П",
//     "Р",
//     "С",
//     "Т",
//     "У",
//     "Ф",
//     "Х",
//     "X",
//     "Ц",
//     "Ч",
//     "Ш",
//     "Щ",
//     "Ь",
//     "Ю",
//     "Я",
//     "0",
//     "1",
//     "2",
//     "3",
//     "4",
//     "5",
//     "6",
//     "7",
//     "8",
//     "9",
//     "Ы",
//     "Ъ",
//     "/",
//     "*",
//     "-",
//     "+",
//     "=",
//     " ",
//     "(",
//     ")",
//     ".",
//     ",",
//     "!",
//     "?",
//     ":",
//     ";",
//     "%",
//     '"',
//     "",
//     "'",
//     "@",
//     "|",
//     "#",
//     "№",
//   ];
//   // Создаем объект для хранения ширины символов
//   const symbolWidths = {};
//   // Измеряем ширину каждого символа
//   ukrainianAlphabet.forEach((symbol) => {
//     const width = ctx.measureText(symbol).width;
//     symbolWidths[symbol] = width;
//   });

const symbolWidths = {
  "": 0,
  0: 6.673828125,
  " ": 3.333984375,
  1: 6.673828125,
  2: 6.673828125,
  3: 6.673828125,
  4: 6.673828125,
  5: 6.673828125,
  6: 6.673828125,
  7: 6.673828125,
  8: 6.673828125,
  9: 6.673828125,
  "!": 3.333984375,
  "#": 6.673828125,
  "%": 10.669921875,
  '"': 4.259765625,
  "'": 2.291015625,
  "(": 3.99609375,
  ")": 3.99609375,
  "*": 4.669921875,
  "+": 7.0078125,
  ",": 3.333984375,
  "-": 3.99609375,
  ".": 3.333984375,
  "/": 3.333984375,
  "::": 3.333984375,
  ";": 3.333984375,
  "=": 7.0078125,
  "?": 6.673828125,
  "@": 12.181640625,
  X: 8.00390625,
  "|": 3.1171875,
  Є: 8.625,
  І: 3.333984375,
  Ї: 3.333984375,
  А: 8.00390625,
  Б: 7.875,
  В: 8.00390625,
  Г: 6.498046875,
  Д: 8.126953125,
  Е: 8.00390625,
  Ж: 11.080078125,
  З: 7.248046875,
  И: 8.625,
  Й: 8.625,
  К: 6.990234375,
  Л: 7.875,
  М: 9.99609375,
  Н: 8.666015625,
  О: 9.333984375,
  П: 8.625,
  Р: 8.00390625,
  С: 8.666015625,
  Т: 7.330078125,
  У: 7.623046875,
  Ф: 9.123046875,
  Х: 8.00390625,
  Ц: 8.876953125,
  Ч: 7.998046875,
  Ш: 10.998046875,
  Щ: 11.25,
  Ъ: 9.498046875,
  Ы: 10.623046875,
  Ь: 7.875,
  Ю: 12.123046875,
  Я: 8.666015625,
  Ґ: 5.865234375,
  "№": 12.873046875,
};
//
export default function importSpaces(str, startNumber) {
  console.log(symbolWidths);
  //
  const str2 = str.replace(/<[^>]*>/g, "").toUpperCase();

  let str2_Length = 0;

  for (let i = 0; i < str2.length; i++) {
    // Если символ строки есть в объекте сравнения, записываем соответствующее значение в результат
    if (str2[i] in symbolWidths) {
      str2_Length += symbolWidths[str2[i]];
    } else {
      str2_Length += symbolWidths[" "];
    }
  }
  const startSpaces = startNumber * symbolWidths[" "];

  //  Сколько же надо пробелов?
  let spaces = "";
  let length = (startSpaces - str2_Length) / symbolWidths[" "];

  for (let i = 0; i < length; i++) {
    spaces += " ";
  }
  // spaces = str2.length >= 18 ? spaces + " " : spaces;
  // console.log(str2,startNumber)
  return spaces;
}
